Merge remote-tracking branch 'origin/dev' into dev_souf
